In [2]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Anny', 'Bobby', 'Charter', 'Devendra'],
    'Age': [24, 27, 22, 32, 45, 33, 44, 20],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston','Japan','China','Singapore','India']
}

df = pd.DataFrame(data)
df

       Name  Age         City
0     Alice   24     New York
1       Bob   27  Los Angeles
2   Charlie   22      Chicago
3     David   32      Houston
4      Anny   45        Japan
5     Bobby   33        China
6   Charter   44    Singapore
7  Devendra   20        India

In [7]:
#dtypes attributes
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [10]:
df.dtypes.values

array([dtype('O'), dtype('int64'), dtype('O')], dtype=object)

In [15]:
#dtypes value_count
df.dtypes.value_counts()

object    2
int64     1
Name: count, dtype: int64